{
  "_id": "SJi7nFzyg-getting-started",
  "fields": {
    "entries": {
      "values": {
        "en": [
          {
            "title": "Install webdesign.io",
            "content": "Before starting, you need to make sure your system has Node.js version 6 (or upper) installed. If it is not the case, please [install Node.js using this link](https://nodejs.org).\n\n### 1. Install webdesign.io CLI\n-------\nwebdesign.io CLI let you develop websites right on your local machine.\n\nWith the CLI, you can initialize a new site and start workin on it using any text editor. And thanks to webdesign.io built-in web server, you can preview the site with your computer's web browser without even setting up a database.\n\nThe CLI can also deploy sites to any webdesign.io Engine using the `webdesignio deploy` command. Your changes will immediately be reflected on that site without restarting or making any changes to the Engine server app.\n\nTo help you work faster, webdesign.io comes with pre-defined workflows like Pug (former JADE) and it easy to integrate it in your current flow. It also works well with source version control systems like git and svn.\n\n**Install webdesign.io**\n```\nnpm install -g @webdesignio/cli\n```"
          },
          {
            "title": "Create a new site",
            "content": "### 2. Create a new site\n-------\nWe start with creating a first website, using our webdesign.io-boilerplate.\n\n**Initialize a new website**\n```\nwebdesignio init <mywebsite>\n```\n\nFor practical reasons, we will use webdesignio.com as our deployment target but you're absolutely free to use your own Engine on EC2, Digital Ocean, Engine Yard, Linodes, Heroku or your own server. Don't forget, everything is open source here.\n\nIf you don't have an account, it will create one for you.\n\n> **NOTE**: Currently the CLI also creates an account for [surge.sh](https://surge.sh/) since this is our current way to upload to AWS S3.\n\n**Launch the webdesign.io server**\n```\nnpm start\n```\n\nOpen your browser at this address [http://localhost:3000/](http://localhost:3000/), you should see the boilerplate."
          },
          {
            "title": "Deploy and edit contents  online",
            "content": "### 3. Deploy the site\n------\n\nNow we have a working site, we want to see it working online. That's the role of the webdesign.io engine.\n\n**Now, let's deploy our site!**\n```\nwebdesignio deploy\n```\n**That's it! The CLI will show two addresses**\n```\n    > Access the backend here: https://<< mywebsite>>.webdesignio.com\n    > Your website will be published at the following urls:\n    >     - language en: https://showcase-b1aho38ke-en.surge.sh\n```\n\nVisit the website: `https://showcase-b1aho38ke-en.surge.sh`.\n\nEdit the website: `https://<< mywebsite>>.webdesignio.com`.\n\n### 4. Modify the live content of your site!\n--------\n\nGo to your `<< mywebsite>>.webdesignio.com` domain and sign in with the credentials you entered in the CLI.\n\nYou will see the boilerplate page. You can now edit contents by just clicking into it. Press \"Save\" to save and publish the changes.\n\nThat's it!"
          },
          {
            "title": "What next?",
            "content": "In less than 5 minutes, you were able to create a website, deploy it online and edit the contents in the frontend.\n\n**We call that Penguin-Power :-)**\n\n### 5. What next?\n--------\n\nAs a next step, you will figure out how to use your own website or template.\n\nIt is really easy to become productive with webdesign.io. After 15 minutes, you will actually have your own website online and you will edit it.\n\nWhat we will go through:\n- Folder Structure (Where goes what?)\n- Asset Function (How to link to static files like *.css and *.js)\n- Components (How to make contents editable?)\n- Save (How to save changes?)\n- Default Contents and Data Contents\n\nWhen you're done, just deploy your changes with the `webdesignio deploy` command!\n"
          }
        ]
      }
    },
    "title": {
      "values": {
        "en": "Getting started"
      }
    },
    "subtitle": {
      "values": {
        "en": "Create a your first site in 5 minutes"
      }
    }
  },
  "type": "docs",
  "website": "webdesignio"
}